/*
 
 (195강)
 아스키코드와 유니코드
 
 스위프트문자열
 - 유니코드
 
 swift는 문자열저장시 유니코드 스칼라값중 4바이트 사용하는 utf32체계를 저장한다
 맥북, 아이폰은 64비트로(8바이트 메모리공간사용) 이루어져있어서
 
 유니코드 저장시 4바이트 공간을 써서 문자 하나씩 저장한다
 utf8, utf16으로 쉽게 변환도 가능
 
 */

/**===========================================================================
 - 스위프트의 문자열(String)?
 - 쌍따옴표 안에 문자(Character)들을 연결

 - 모든 문자열은 개별 인코딩된 유니코드 문자들(encoding-independent Unicode characters)로 구성
 - 유니코드 값(코드포인트 - 스칼라값)
                                                  4바이트
 - 결국, 스위프트는 문자열을 저장할때, 하나의 문자를 유니코드의 스칼라값(UTF-32)으로 저장
   그리고 언제든지 UTF-8, UTF-16방식으로도 쉽게 변환할 수 있는 방법도 제공해줌
   1) 문자열.unicodeScalars
   2) 문자열.utf8
   3) 문자열.utf16
==============================================================================**/

import UIKit



var someString: String = "Some Swift😃"

for code in someString.unicodeScalars {
    print(code.value)
}


someString = "\u{53}\u{6F}\u{6D}\u{65}\u{20}\u{53}\u{77}\u{69}\u{66}\u{74}\u{1F603}"

print(someString)


/**=====================================
 - 문자열    UTF-32값         (16진법 표현)
 - "S"     -   83   ====>    53 (16진법)
 - "o"     -  111   ====>    6F (16진법)
 - "m"     -  109   ====>    6D (16진법)
 - "e"     -  101   ====>    65 (16진법)
 - " "     -   32   ====>    20 (16진법)
 - "S"     -   83   ====>    53 (16진법)
 - "w"     -  119   ====>    77 (16진법)
 - "i"     -  105   ====>    69 (16진법)
 - "f"     -  102   ====>    66 (16진법)
 - "t"     -  116   ====>    74 (16진법)
 - "😃"    -128515  ====> 1F603 (16진법)
========================================**/




/**=================================================================
 - 스위프트는 내부적으로 문자열을 UTF-32방식으로 저장하고 있지만
   나머지, UTF-8, UTF-16방식으로도 쉽게 변환할 수 있는 방법도 제공해줌
  (코드값을 사용하려면 물론, for문을 통해서 내부에서 요소를 다시 추출해서 사용해야함)
 ===================================================================**/

// https://docs.swift.org/swift-book/documentation/the-swift-programming-language/stringsandcharacters/
let dogString = "Dog‼🐶"
print(dogString.utf8)

for codeUnit in dogString.utf8 {
    print("\(codeUnit) ", terminator: "")
}
print()

for codeUnit in dogString.utf16 {
    print("\(codeUnit) ", terminator: "")
}
print()

for codeUnit in dogString.unicodeScalars {
    print("\(codeUnit) ", terminator: "")
}
print()



// 스위프트는 결국, 어떠한 유니코드 인코딩 방식으로도 변환이 쉬움



// MARK: 유니코드 체계에서는 코드가 다른 방식으로 저장되더라도 인간실생활과 가깝게 코드를 변환해서 인식을 한다
var hangul1 = "\u{D55C}" // 한
print("\"한\"의 글자수: ", hangul1.count) // ""한"의 글자수: 1"

var hangul2 = "\u{1112}\u{1161}\u{11AB}"      // "ㅎ" "ㅏ" "ㄴ"
print("\"ㅎ\"+\"ㅏ\"+\"ㄴ\"의 글자수: ", hangul2.count)

hangul1 == hangul2 // true


var word = "cafe"
print("글자의 숫자 \(word) is \(word.count)")
// "글자의 숫자 cafe is 4"

word += "\u{301}"    // COMBINING ACUTE ACCENT, U+0301

print("글자의 숫자 \(word) is \(word.count)")
// "글자의 숫자 café is 4"

// MARK: 유니코드에 코드가 더해짐에도 불구하고 글자수를 셀때는 합쳐서 본다





// MARK: 스위프트 문자열에서 배열같은 단순 인덱스 접근이 불가능


/*
 "Some Swift"
 "S" + "o" + "m" + "e" ...
 */


// MARK: NSString(foundation에 정의됨)

/**===============================================================
 - 스위프트에서는 2개의 문자열 자료형을 사용

 - 문자열 내부적으로 서로 연동(bridged)
 - 1) String ▶︎ Swift String  구조체/값형식 (스위프트 문자열)
 - 2) NSString ▶︎ Foundation String  클래스/참조형식  (파운데이션 문자열)
==================================================================**/


var nsString: NSString = "Swift"



// 타입캐스팅
// 서로간의 타입캐스팅이 된다 == 브릿징이 가능한 타입이다
// 두형식은 브릿징이 가능한 타입 (Toll-Free Bidged) ===> 타입캐스팅으로 호환되는 자료형
let string: String = nsString as String


// String <===> NSString간에 자동으로 변환컨버팅되지는 않음(타입캐스팅해야함)


nsString.length       // NSString의 length속성 ===> 유니코드수(UTF-16) 기반
string.count          // String의    count속성 ===> 의미 글자수 기반
